kAMDSuccess = "エラーはありませんでした。";
kAMDUndefinedError = "不明なエラーが起きました。";
kAMDBadHeaderError = "ファイルを転送できませんでした。";
kAMDNoResourcesError = "リソースを割り当てることができませんでした。";
kAMDReadError = "デバイスから読み込めませんでした。";
kAMDWriteError = "デバイスに書き込めませんでした。";
kAMDUnknownPacketError = "パケットが不明です。";
kAMDInvalidArgumentError = "引数が無効です。";
kAMDNotFoundError = "ファイルが見つかりませんでした。";
kAMDIsDirectoryError = "そのパスはディレクトリです。";
kAMDPermissionError = "アクセス権がありません。";
kAMDNotConnectedError = "デバイスに接続されていません。";
kAMDTimeOutError = "操作はタイムアウトになりました。";
kAMDOverrunError = "バッファ・オーバーランがありました。";
kAMDEOFError = "ファイルの終わりです。";
kAMDUnsupportedError = "この操作はサポートされていません。";
kAMDFileExistsError = "ファイルがすでに存在します。";
kAMDBusyError = "デバイスは使用中です。";
kAMDCryptoError = "デバイスとのセキュリティ保護された接続を確立できませんでした。";
kAMDTooBigError = "メッセージが大きすぎます。";
kAMDInvalidResponseError = "デバイスから予期しない応答を受信しました。";
kAMDMissingKeyError = "キーが見つかりません。";
kAMDMissingValueError = "値が見つかりません。";
kAMDGetProhibitedError = "パスコードロックされたデバイスから値を取得することはできません。";
kAMDSetProhibitedError = "デバイス上の値を設定できません。";
kAMDRemoveProhibitedError = "デバイス上の値を削除できません。";
kAMDImmutableValueError = "この値は変更できません。";
kAMDPasswordProtectedError = "デバイスはパスコードで保護されています。";
kAMDMissingHostIDError = "デバイスがこのホストを認識しません。";
kAMDInvalidHostIDError = "デバイスがこのホストを認識しません。";
kAMDSessionActiveError = "セッションが進行中です。";
kAMDSessionInactiveError = "セッションが進行中ではありません。";
kAMDMissingSessionIDError = "セッションIDが見つかりません。";
kAMDInvalidSessionIDError = "セッションIDが無効です。";
kAMDMissingServiceError = "サービスが見つかりません。";
kAMDInvalidServiceError = "サービスが無効です。";
kAMDServiceLimitError = "すでに実行されているこのサービスのインスタンスが多すぎます。";
kAMDCheckinSetupFailedError = "デバイスでサービスを開始できませんでした";
kAMDInvalidCheckinError = "デバイスでサービスを開始できませんでした";
kAMDCheckinTimeoutError = "デバイスでサービスが適切に開始されませんでした。";
kAMDCheckinConnectionFailedError = "デバイスでサービスが適切に開始されませんでした。";
kAMDCheckinReceiveFailedError = "デバイスでサービスが適切に開始されませんでした。";
kAMDCheckinResponseFailedError = "デバイスでサービスが適切に開始されませんでした。";
kAMDCheckinOutOfMemoryError = "デバイスでサービスが適切に開始されませんでした。";
kAMDCheckinSendFailedError = "デバイスでサービスが適切に開始されませんでした。";
kAMDMissingPairRecordError = "ホストはそのデバイスとペアリングされていません。";
kAMDInvalidPairRecordError = "ホストはもうそのデバイスとペアリングされていません。";
kAMDSavePairRecordFailedError = "ペアリングの記録を保存できませんでした。";
kAMDInvalidActivationRecordError = "アクティベーションの記録が有効ではありません。";
kAMDMissingActivationRecordError = "アクティベーションの記録が見つかりませんでした。";
kAMDServiceProhibitedError = "デバイスでサービスを開始できませんでした。";
kAMDEscrowLockedError = "デバイスは起動後1回ロック解除されるまでは使用できません。";
kAMDProhibitedBySupervision = "監督されているデバイス上で操作が禁止されています。";
kAMDPairingProhibitedError = "ペアリングはUSB経由でのみ許可されています。";
kAMDWrongDroidError = "デバイスはリカバリモードです。";
kAMDSUVerificationError = "ソフトウェア・アップデート・パッケージを検証できませんでした。";
kAMDSUPatchError = "ファイルにパッチを当てることができませんでした。";
kAMDSUFirmwareError = "ファームウェアをフラッシュできませんでした。";
kAMDProvisioningProfileNotValid = "プロビジョニングプロファイルが有効ではありません。";
kAMDSendMessageError = "デバイスにメッセージを送信できませんでした。";
kAMDReceiveMessageError = "デバイスからメッセージを受け取れませんでした。";
kAMDMissingOptionsError = "オプションが見つかりません。";
kAMDMissingImageTypeError = "イメージが見つかりません。";
kAMDDigestFailedError = "ディスクイメージを読み込めませんでした。";
kAMDStartServiceError = "サービスを開始できませんでした。";
kAMDInvalidDiskImageError = "ディスクイメージが無効です。";
kAMDMissingDigestError = "ダイジェストが見つかりません。";
kAMDMuxError = "USBデバイスのマルチプレクサーでエラーが起きました。";
kAMDApplicationAlreadyInstalledError = "指定したバンドル識別子を持つシステムアプリケーションがすでにデバイスにインストールされていて、置き換えることができません。";
kAMDApplicationMoveFailedError = "Appをデバイスに移動できませんでした。";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "Appをサンドッボックス化できませんでした。";
kAMDApplicationVerificationFailedError = "Appを検証できませんでした。";
kAMDArchiveDestructionFailedError = "アプリケーションアーカイブを削除できませんでした。";
kAMDBundleVerificationFailedError = "キャリアバンドルを検証できませんでした。";
kAMDCarrierBundleCopyFailedError = "キャリアバンドルをインストールできませんでした。";
kAMDCarrierBundleDirectoryCreationFailedError = "キャリア・バンドル・ディレクトリを作成できませんでした。";
kAMDCarrierBundleMissingSupportedSIMsError = "このキャリアバンドルに対応したSIMはありません。";
kAMDCommCenterNotificationFailedError = "ベースバンドからの通知を聞くことができませんでした。";
kAMDContainerCreationFailedError = "アプリケーションコンテナを作成できませんでした。";
kAMDContainerP0wnFailedError = "アプリケーションコンテナのアクセス権を修復できませんでした。";
kAMDContainerRemovalFailedError = "アプリケーションコンテナを削除できませんでした。";
kAMDEmbeddedProfileInstallFailedError = "埋め込まれたプロビジョニングプロファイルをインストールできませんでした。";
kAMDErrorError = "エラーが起きました。";
kAMDExecutableTwiddleFailedError = "Appの実行可能アクセス権を変更できませんでした。";
kAMDExistenceCheckFailedError = "Appがすでに存在するかどうかを確認できませんでした。";
kAMDInstallMapUpdateFailedError = "インストールされたAppのリストをアップデートできませんでした。";
kAMDManifestCaptureFailedError = "アプリケーションマニフェストを保存できませんでした。";
kAMDMapGenerationFailedError = "マップを生成できませんでした。";
kAMDMissingBundleExecutableError = "アプリケーションバンドルに実行可能ファイルが含まれていません。";
kAMDMissingBundleIdentifierError = "アプリケーションバンドルに有効な識別子が含まれていません。";
kAMDMissingBundlePathError = "アプリケーションバンドルのパスを特定できませんでした。";
kAMDMissingContainerError = "インストールされたアプリケーションのコンテナを見つけることができませんでした。";
kAMDNotificationFailedError = "通知をポストできませんでした。";
kAMDPackageExtractionFailedError = "アプリケーションパッケージを開けませんでした。";
kAMDPackageInspectionFailedError = "アプリケーションパッケージを検査できませんでした。";
kAMDPackageMoveFailedError = "アプリケーションパッケージをステージングの場所に移動できませんでした。";
kAMDPathConversionFailedError = "パスを変換できませんでした。";
kAMDRestoreContainerFailedError = "アプリケーションコンテナを復元できませんでした。";
kAMDSeatbeltProfileRemovalFailedError = "アプリケーション・シートベルト・プロファイルを削除できませんでした。";
kAMDStageCreationFailedError = "ステージングディレクトリを作成できませんでした。";
kAMDSymlinkFailedError = "シンボリックリンクを作成できませんでした。";
kAMDiTunesArtworkCaptureFailedError = "iTunesのアートワークを保存できませんでした。";
kAMDiTunesMetadataCaptureFailedError = "iTunesのメタデータを保存できませんでした。";
kAMDAlreadyArchivedError = "Appはアーカイブ済みです。";
kAMDUnknownCommandError = "デバイスがコマンドを認識しません。";
kAMDAPIInternalError = "内部APIエラーが起きました。";
kAMDMuxCreateListenerError = "USBデバイスを聞くことができませんでした。";
kAMDMuxGetListenerError = "USBリスナーを取得できませんでした。";
kAMDMuxConnectError = "デバイスに接続できませんでした。";
kAMDDeviceTooNewError = "このAppはアップデートする必要があります。";
kAMDDeviceRefNoGood = "このデバイスには接続できません。";
kAMDDeviceDisconnectedError = "このデバイスには接続できません。";
kAMDCannotTranslateError = "デバイスからのメッセージを解釈できませんでした。";
kAMDMobileImageMounterMissingImageSignature = "開発をサポートできませんでした。";
kAMDMobileImageMounterResponseCreationFailed = "開発をサポートできませんでした。";
kAMDMobileImageMounterMissingImageType = "開発をサポートできませんでした。";
kAMDMobileImageMounterMissingImagePath = "開発をサポートできませんでした。";
kAMDMobileImageMounterImageMapLoadFailed = "開発をサポートできませんでした。";
kAMDMobileImageMounterAlreadyMounted = "開発をサポートできませんでした。";
kAMDMobileImageMounterImageMoveFailed = "開発をサポートできませんでした。";
kAMDMobileImageMounterMountPathMissing = "開発をサポートできませんでした。";
kAMDMobileImageMounterMountPathNotEmpty = "開発をサポートできませんでした。";
kAMDMobileImageMounterImageMountFailed = "開発をサポートできませんでした。";
kAMDMobileImageMounterTrustCacheLoadFailed = "開発をサポートできませんでした。";
kAMDMobileImageMounterDigestFailed = "開発をサポートできませんでした。";
kAMDMobileImageMounterDigestCreationFailed = "開発をサポートできませんでした。";
kAMDMobileImageMounterImageVerificationFailed = "開発をサポートできませんでした。";
kAMDMobileImageMounterImageInfoCreationFailed = "開発をサポートできませんでした。";
kAMDMobileImageMounterImageMapStoreFailed = "開発をサポートできませんでした。";
kAMDDeviceOSVersionTooLow = "デバイスのOSバージョンが古すぎます。";
kAMDNoWifiSyncSupportError = "このデバイスは無線同期機能に対応していません。";
kAMDDeviceFamilyNotSupported = "このアプリケーションは、この種類のデバイスをサポートしていません。";
kAMDPackagePatchFailedError = "アプリケーションにパッチアップデートを適用できませんでした。";
kAMDIncorrectArchitectureError = "このアプリケーションはこのデバイスのCPUのタイプをサポートしていません。";
kAMDPluginCopyFailedError = "AppコンテナにVPNプラグインをコピーできませんでした。";
kAMDBreadcrumbFailedError = "インストールのパンくずリストを書き込めませんでした。";
kAMDBreadcrumbUnlockError = "インストールのパンくずリストをアップデートできませんでした。";
kAMDGeoJSONCaptureFailedError = "GeoJSONデータを保存できませんでした。";
kAMDNewsstandArtworkCaptureFailedError = "Newsstandのアートワークを保存できませんでした。";
kAMDMissingCommandError = "リクエストにコマンドが含まれていませんでした。";
kAMDNotEntitledError = "リクエスト元のアプリケーションは、このリクエストの作成を許可されていません。";
kAMDMissingPackagePathError = "リクエストにパッケージパスがありませんでした。";
kAMDMissingContainerPathError = "リクエストにコンテナパスがありませんでした。";
kAMDMissingApplicationIdentifierError = "リクエストにアプリケーション識別子がありませんでした。";
kAMDMissingAttributeValueError = "リクエストに必要な値がありませんでした。";
kAMDLookupFailedError = "インストールされたアプリケーションをリスト表示できませんでした。";
kAMDDictCreationFailedError = "リクエストから機能を取り出せませんでした。";

/* kMISFileError */
"A file operation failed." = "ファイル操作に失敗しました。";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "署名済みリソースが追加、変更、削除されました。";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "この実行可能ファイル用の有効なプロビジョニングプロファイルが見つかりませんでした。";

/* kMISUnknownError */
"An unknown error has occurred." = "不明なエラーが起きました。";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "変更不可のプロビジョニングプロファイルを変更しようとしました。";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "Appに有効な署名がありません。";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "Appの署名は有効ですが予期したハッシュに一致しません。";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "この実行可能ファイルに含まれている署名は有効ではありません。";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "この実行可能ファイルは無効な署名権限により署名されています。";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "この実行可能ファイル用の署名に使用されたIDは有効期限切れです。";

/* kMISSignatureNotValidError */
"The signature was not valid." = "署名が有効ではありませんでした。";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "お使いのデバイスとの通信中にエラーが起きました。";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "このプロビジョニングプロファイルはこのデバイスにはインストールできません。";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "このプロビジョニングプロファイルには有効な署名がありません。または、有効な署名ですが信頼できません。";

/* kMISExpiredError */
"This provisioning profile has expired." = "このプロビジョニングプロファイルは有効期限切れです。";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "このプロビジョニングプロファイルのフォーマットは正しくありません。";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "このプロビジョニングプロファイルはサポートされていません。";

/* kMISAllocationError */
"Unable to allocate memory." = "メモリを割り当てられません。";

